## HW 6 Cypher Data Import Help for 3D Print Shop

Lisa Over
CMPINF 2110
April 9, 2021

In [1]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt

import seaborn as sns

### Read in the CSV files

In [2]:
url_file = 'https://raw.githubusercontent.com/jyurko/CMPINF_2110_Spring_2021_data/main/hw06/devices.csv'
devices = pd.read_csv(url_file)

In [3]:
devices.to_csv('devices.csv', index=False)

In [4]:
url_file = 'https://raw.githubusercontent.com/jyurko/CMPINF_2110_Spring_2021_data/main/hw06/employees.csv'
employees = pd.read_csv(url_file)

In [5]:
employees.to_csv('employees.csv', index=False)

In [6]:
url_file = 'https://raw.githubusercontent.com/jyurko/CMPINF_2110_Spring_2021_data/main/hw06/employees_assembles_devices.csv'
emp_assembles_devices = pd.read_csv(url_file)

In [7]:
emp_assembles_devices.to_csv('employees_assembles_devices.csv', index=False)

In [8]:
url_file = 'https://raw.githubusercontent.com/jyurko/CMPINF_2110_Spring_2021_data/main/hw06/machines.csv'
machines = pd.read_csv(url_file)

In [9]:
machines.to_csv('machines.csv', index=False)

In [10]:
url_file = 'https://raw.githubusercontent.com/jyurko/CMPINF_2110_Spring_2021_data/main/hw06/machines_prints_jobs.csv'
mach_prints_jobs = pd.read_csv(url_file)

In [11]:
mach_prints_jobs.to_csv('machines_prints_jobs.csv', index=False)

In [12]:
url_file = 'https://raw.githubusercontent.com/jyurko/CMPINF_2110_Spring_2021_data/main/hw06/part_componet_of_device.csv'
part_comp_device = pd.read_csv(url_file)

In [13]:
part_comp_device.to_csv('part_component_of_device.csv, index=False', index=False)

In [14]:
url_file = 'https://raw.githubusercontent.com/jyurko/CMPINF_2110_Spring_2021_data/main/hw06/parts.csv'
parts = pd.read_csv(url_file)

In [15]:
parts.to_csv('parts.csv', index=False)

In [16]:
url_file = 'https://raw.githubusercontent.com/jyurko/CMPINF_2110_Spring_2021_data/main/hw06/parts_in_jobs.csv'
parts_in_jobs = pd.read_csv(url_file)

In [17]:
parts_in_jobs.to_csv('parts_in_jobs.csv', index=False)

#### Explore parts_in_jobs and machines_prints_jobs data

In [18]:
parts_in_jobs

     item_id  part_id  job_id
0          1        4       1
1          2        4       1
2          3        1       2
3          4        3       2
4          5        2       3
..       ...      ...     ...
144      145        5      48
145      146        3      48
146      147        5      49
147      148        5      49
148      149        3      49

[149 rows x 3 columns]

In [19]:
parts_in_jobs.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 149 entries, 0 to 148
Data columns (total 3 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   item_id  149 non-null    int64
 1   part_id  149 non-null    int64
 2   job_id   149 non-null    int64
dtypes: int64(3)
memory usage: 3.6 KB

In [20]:
parts_in_jobs.nunique()

item_id    149
part_id      7
job_id      49
dtype: int64

In [21]:
mach_prints_jobs.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 49 entries, 0 to 48
Data columns (total 3 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   job_id       49 non-null     int64
 1   machine_id   49 non-null     int64
 2   employee_id  49 non-null     int64
dtypes: int64(3)
memory usage: 1.3 KB

In [22]:
mach_prints_jobs.nunique()

job_id         49
machine_id      4
employee_id     5
dtype: int64

In [23]:
mach_prints_jobs

    job_id  machine_id  employee_id
0        1           2            2
1        2           4            4
2        3           4            5
3        4           4            5
4        5           2            2
5        6           1            5
6        7           4            3
7        8           3            4
8        9           4            4
9       10           3            2
10      11           3            4
11      12           3            4
12      13           1            5
13      14           4            1
14      15           1            3
15      16           1            2
16      17           2            2
17      18           1            3
18      19           1            5
19      20           2            5
20      21           3            5
21      22           3            1
22      23           3            1
23      24           3            5
24      25           1            2
25      26           3            2
26      27           3            1
27      28           4            2
28      29           3            5
29      30           1            3
30      31           4            2
31      32           4            5
32      33           2            2
33      34           2            4
34      35           1            1
35      36           4            2
36      37           1            5
37      38           2            1
38      39           2            4
39      40           4            4
40      41           3            3
41      42           2            1
42      43           1            5
43      44           4            5
44      45           3            1
45      46           2            5
46      47           1            5
47      48           2            5
48      49           3            2

In [24]:
parts_in_jobs

     item_id  part_id  job_id
0          1        4       1
1          2        4       1
2          3        1       2
3          4        3       2
4          5        2       3
..       ...      ...     ...
144      145        5      48
145      146        3      48
146      147        5      49
147      148        5      49
148      149        3      49

[149 rows x 3 columns]

In [25]:
parts_in_jobs.loc[:,['item_id','job_id','part_id']].copy().\
groupby(['job_id','part_id']).size().reset_index(name='num_rows').head(20)

    job_id  part_id  num_rows
0        1        4         2
1        2        1         1
2        2        3         1
3        3        2         1
4        3        4         1
5        4        1         1
6        4        4         1
7        5        5         2
8        6        1         1
9        6        3         1
10       6        4         2
11       7        5         2
12       8        2         1
13       8        3         2
14       8        5         1
15       9        4         1
16       9        6         1
17      10        3         1
18      10        5         2
19      10        7         1

In [26]:
parts_in_jobs.loc[:,['item_id','job_id','part_id']].copy().\
merge(mach_prints_jobs.loc[:,['machine_id','job_id']].copy(), on='job_id', how='left').head(20)

    item_id  job_id  part_id  machine_id
0         1       1        4           2
1         2       1        4           2
2         3       2        1           4
3         4       2        3           4
4         5       3        2           4
5         6       3        4           4
6         7       4        4           4
7         8       4        1           4
8         9       5        5           2
9        10       5        5           2
10       11       6        3           1
11       12       6        4           1
12       13       6        4           1
13       14       6        1           1
14       15       7        5           4
15       16       7        5           4
16       17       8        3           3
17       18       8        3           3
18       19       8        2           3
19       20       8        5           3

#### Determine how many nodes to expect for each label

In [27]:
employees.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 3 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   employee_id  5 non-null      int64
 1   name         5 non-null      object
 2   started      5 non-null      int64
dtypes: int64(2), object(1)
memory usage: 248.0+ bytes

In [28]:
employees.employee_id.nunique()

5

In [29]:
machines.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 3 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   machine_id  4 non-null      int64
 1   name        4 non-null      object
 2   type        4 non-null      object
dtypes: int64(1), object(2)
memory usage: 224.0+ bytes

In [30]:
machines.machine_id.nunique()

4

In [31]:
mach_prints_jobs.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 49 entries, 0 to 48
Data columns (total 3 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   job_id       49 non-null     int64
 1   machine_id   49 non-null     int64
 2   employee_id  49 non-null     int64
dtypes: int64(3)
memory usage: 1.3 KB

In [32]:
mach_prints_jobs.job_id.nunique()

49

In [33]:
parts.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7 entries, 0 to 6
Data columns (total 2 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   part_id  7 non-null      int64
 1   type     7 non-null      object
dtypes: int64(1), object(1)
memory usage: 240.0+ bytes

In [34]:
parts.part_id.nunique()

7

In [35]:
devices.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 2 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   device_id  4 non-null      int64
 1   class      4 non-null      object
dtypes: int64(1), object(1)
memory usage: 192.0+ bytes

In [36]:
devices.device_id.nunique()

4

In [37]:
parts_in_jobs.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 149 entries, 0 to 148
Data columns (total 3 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   item_id  149 non-null    int64
 1   part_id  149 non-null    int64
 2   job_id   149 non-null    int64
dtypes: int64(3)
memory usage: 3.6 KB

In [38]:
parts_in_jobs.item_id.nunique()

149

In [39]:
emp_assembles_devices.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 50 entries, 0 to 49
Data columns (total 3 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   assembly_id  50 non-null     int64
 1   device_id    50 non-null     int64
 2   employee_id  50 non-null     int64
dtypes: int64(3)
memory usage: 1.3 KB

In [40]:
emp_assembles_devices.assembly_id.nunique()

50

#### Determine how many relationships to expect between machines and jobs

In [41]:
mach_prints_jobs.groupby(['job_id', 'machine_id']).size().\
reset_index(name='num_rows').info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 49 entries, 0 to 48
Data columns (total 3 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   job_id      49 non-null     int64
 1   machine_id  49 non-null     int64
 2   num_rows    49 non-null     int64
dtypes: int64(3)
memory usage: 1.3 KB

#### Determine how many relationships to expect between employees and machines

In [42]:
mach_prints_jobs.groupby(['employee_id', 'machine_id']).size().\
reset_index(name='num_rows').info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 18 entries, 0 to 17
Data columns (total 3 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   employee_id  18 non-null     int64
 1   machine_id   18 non-null     int64
 2   num_rows     18 non-null     int64
dtypes: int64(3)
memory usage: 560.0 bytes

#### Determine how many relationships to expect between employees and jobs

In [43]:
mach_prints_jobs.groupby(['employee_id', 'job_id']).size().\
reset_index(name='num_rows').info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 49 entries, 0 to 48
Data columns (total 3 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   employee_id  49 non-null     int64
 1   job_id       49 non-null     int64
 2   num_rows     49 non-null     int64
dtypes: int64(3)
memory usage: 1.3 KB

#### Determine how many relationships  to expect between parts and jobs

In [44]:
parts_in_jobs.groupby(['part_id', 'job_id']).size().\
reset_index(name='num_rows').info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 119 entries, 0 to 118
Data columns (total 3 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   part_id   119 non-null    int64
 1   job_id    119 non-null    int64
 2   num_rows  119 non-null    int64
dtypes: int64(3)
memory usage: 2.9 KB

#### Determine how many relationships  to expect between items and jobs

In [45]:
parts_in_jobs.groupby(['item_id', 'job_id']).size().\
reset_index(name='num_rows').info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 149 entries, 0 to 148
Data columns (total 3 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   item_id   149 non-null    int64
 1   job_id    149 non-null    int64
 2   num_rows  149 non-null    int64
dtypes: int64(3)
memory usage: 3.6 KB

#### Determine how many relationships  to expect between items and parts

In [46]:
parts_in_jobs.groupby(['item_id', 'part_id']).size().\
reset_index(name='num_rows').info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 149 entries, 0 to 148
Data columns (total 3 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   item_id   149 non-null    int64
 1   part_id   149 non-null    int64
 2   num_rows  149 non-null    int64
dtypes: int64(3)
memory usage: 3.6 KB

#### Determine how many relationships to expect between items and assemblies

In [47]:
part_comp_device.groupby(['item_id','assembly_id']).size().\
reset_index(name='num_rows').info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 149 entries, 0 to 148
Data columns (total 3 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   item_id      149 non-null    int64
 1   assembly_id  149 non-null    int64
 2   num_rows     149 non-null    int64
dtypes: int64(3)
memory usage: 3.6 KB

#### Determine how many relationships to expect between employees and assemblies

In [48]:
emp_assembles_devices.groupby(['assembly_id','employee_id']).size().\
reset_index(name='num_rows').info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 50 entries, 0 to 49
Data columns (total 3 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   assembly_id  50 non-null     int64
 1   employee_id  50 non-null     int64
 2   num_rows     50 non-null     int64
dtypes: int64(3)
memory usage: 1.3 KB

#### Determine how many relationships to expect between employees and devices

In [49]:
emp_assembles_devices.groupby(['device_id','employee_id']).size().\
reset_index(name='num_rows').info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 19 entries, 0 to 18
Data columns (total 3 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   device_id    19 non-null     int64
 1   employee_id  19 non-null     int64
 2   num_rows     19 non-null     int64
dtypes: int64(3)
memory usage: 584.0 bytes

#### Determine how many relationships to expect between assemblies and devices

In [50]:
emp_assembles_devices.groupby(['assembly_id','device_id']).size().\
reset_index(name='num_rows').info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 50 entries, 0 to 49
Data columns (total 3 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   assembly_id  50 non-null     int64
 1   device_id    50 non-null     int64
 2   num_rows     50 non-null     int64
dtypes: int64(3)
memory usage: 1.3 KB

#### Determine how many relationships to expect between parts and devices

In [51]:
parts_in_jobs.loc[:,['item_id','part_id']].copy().\
merge(part_comp_device.loc[:,['item_id','assembly_id']].copy(), on='item_id', how='left').\
groupby(['part_id', 'assembly_id']).size().reset_index(name='num_rows').info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 122 entries, 0 to 121
Data columns (total 3 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   part_id      122 non-null    int64
 1   assembly_id  122 non-null    int64
 2   num_rows     122 non-null    int64
dtypes: int64(3)
memory usage: 3.0 KB

#### Determine how many relationships to expect between employees and devices

In [52]:
emp_assembles_devices.groupby(['employee_id', 'device_id']).size().\
reset_index(name='num_rows').info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 19 entries, 0 to 18
Data columns (total 3 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   employee_id  19 non-null     int64
 1   device_id    19 non-null     int64
 2   num_rows     19 non-null     int64
dtypes: int64(3)
memory usage: 584.0 bytes

In [53]:
emp_assembles_devices.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 50 entries, 0 to 49
Data columns (total 3 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   assembly_id  50 non-null     int64
 1   device_id    50 non-null     int64
 2   employee_id  50 non-null     int64
dtypes: int64(3)
memory usage: 1.3 KB

In [54]:
emp_assembles_devices.assembly_id.nunique()

50

#### Determine the number of distinct physical parts printed by each machine

In [55]:
parts_in_jobs.loc[:,['item_id','job_id','part_id']].copy().\
merge(mach_prints_jobs.loc[:,['machine_id','job_id']].copy(), on='job_id', how='left').\
groupby(['machine_id']).size().reset_index(name='num_rows')

   machine_id  num_rows
0           1        48
1           2        22
2           3        55
3           4        24

In [56]:
parts_in_jobs.loc[:,['item_id','job_id','part_id']].copy().\
merge(mach_prints_jobs.loc[:,['machine_id','job_id']].copy(), on='job_id', how='left').head(20)

    item_id  job_id  part_id  machine_id
0         1       1        4           2
1         2       1        4           2
2         3       2        1           4
3         4       2        3           4
4         5       3        2           4
5         6       3        4           4
6         7       4        4           4
7         8       4        1           4
8         9       5        5           2
9        10       5        5           2
10       11       6        3           1
11       12       6        4           1
12       13       6        4           1
13       14       6        1           1
14       15       7        5           4
15       16       7        5           4
16       17       8        3           3
17       18       8        3           3
18       19       8        2           3
19       20       8        5           3

#### All entities related to Jobs job_id=3

In [57]:
mach_prints_jobs.loc[mach_prints_jobs['job_id']==3].copy().\
merge(employees.loc[:,['employee_id', 'name']].copy(), on='employee_id', how='left').\
merge(machines.loc[:, ['machine_id', 'name']].copy(), on='machine_id', how='left').\
merge(parts_in_jobs.loc[:, ['job_id', 'item_id', 'part_id']].copy(), on='job_id', how='left').\
merge(parts.loc[:, ['part_id', 'type']].copy(), on='part_id', how='left').\
rename(columns={'name_x':'employee', 'name_y':'machine'})

,job_id,machine_id,employee_id,employee,machine,item_id,part_id,type
0,3,4,5,Emily,delta,5,2,gizmo
1,3,4,5,Emily,delta,6,4,sprocket

In [58]:
parts_in_jobs.loc[parts_in_jobs['item_id'].isin([5, 6])].copy().\
merge(part_comp_device.loc[:,['item_id', 'assembly_id']].copy(), on='item_id', how='left').\
merge(emp_assembles_devices.loc[:,['assembly_id', 'device_id', 'employee_id']].copy(), on='assembly_id', how='left').\
merge(parts.loc[:, ['part_id','type']].copy(), on='part_id', how='left').\
merge(employees.loc[:,['employee_id','name']].copy(), on='employee_id', how='left').\
merge(devices.loc[:,['device_id','class']].copy(), on='device_id', how='left')

,item_id,part_id,job_id,assembly_id,device_id,employee_id,type,name,class
0,5,2,3,2,1,2,gizmo,Bob,doohickey
1,6,4,3,3,2,2,sprocket,Bob,thing

#### All entities related to employee 'Alice'

In [59]:
employees.loc[employees['name']=='Alice'].copy().\
merge(mach_prints_jobs.loc[:, ['job_id','machine_id','employee_id']].copy(), on='employee_id', how='left').\
merge(machines.loc[:, ['machine_id', 'name']].copy(), on='machine_id', how='left').\
rename(columns={'name_x':'employee', 'name_y':'machine'})

   employee_id employee  started  job_id  machine_id  machine
0            1    Alice     2017      14           4    delta
1            1    Alice     2017      22           3  charlie
2            1    Alice     2017      23           3  charlie
3            1    Alice     2017      27           3  charlie
4            1    Alice     2017      35           1    alpha
5            1    Alice     2017      38           2    bravo
6            1    Alice     2017      42           2    bravo
7            1    Alice     2017      45           3  charlie

In [60]:
employees.loc[employees['name']=='Alice'].copy().\
merge(emp_assembles_devices.loc[:, ['assembly_id','device_id','employee_id']].copy(), on='employee_id', how='left').\
merge(devices.loc[:, ['device_id', 'class']].copy(), on='device_id', how='left')

   employee_id   name  started  assembly_id  device_id      class
0            1  Alice     2017           11          2      thing
1            1  Alice     2017           12          2      thing
2            1  Alice     2017           20          2      thing
3            1  Alice     2017           21          4     object
4            1  Alice     2017           26          1  doohickey
5            1  Alice     2017           27          1  doohickey
6            1  Alice     2017           42          2      thing
7            1  Alice     2017           47          1  doohickey

#### Operation and Assembly counts for emloyee named 'Alice'

In [75]:
employees.loc[employees['name']=='Alice'].copy().\
merge(mach_prints_jobs.loc[:, ['job_id','machine_id','employee_id']].copy(), on='employee_id', how='left').\
merge(machines.loc[:, ['machine_id', 'name']].copy(), on='machine_id', how='left').\
rename(columns={'name_x':'employee', 'name_y':'machine'}).\
groupby(['machine']).size().reset_index(name='num_rows')

   machine  num_rows
0    alpha         1
1    bravo         2
2  charlie         4
3    delta         1

In [76]:
employees.loc[employees['name']=='Alice'].copy().\
merge(emp_assembles_devices.loc[:, ['assembly_id','device_id','employee_id']].copy(), on='employee_id', how='left').\
merge(devices.loc[:, ['device_id', 'class']].copy(), on='device_id', how='left').\
groupby(['class']).size().reset_index(name='num_rows')

       class  num_rows
0  doohickey         3
1     object         1
2      thing         4

#### Determine the number of distinct parts (part types) printed by each machine

In [61]:
parts_list = parts_in_jobs.loc[:,['part_id','job_id']].copy().\
groupby(['part_id']).size().reset_index(name='num_rows')

In [62]:
parts_list

   part_id  num_rows
0        1        15
1        2        12
2        3        24
3        4        41
4        5        35
5        6        11
6        7        11

In [77]:
parts_in_jobs.loc[:,['item_id','job_id','part_id']].copy().\
merge(mach_prints_jobs.loc[:,['machine_id', 'job_id']].copy(), on='job_id', how='left').\
merge(machines.loc[:,['machine_id', 'name']].copy(), on='machine_id', how='left').\
groupby(['name', 'part_id']).size().reset_index(name='num_rows').\
groupby(['name']).size().reset_index(name='num_rows')

      name  num_rows
0    alpha         7
1    bravo         5
2  charlie         7
3    delta         7

In [78]:
parts

   part_id      type
0        1    widget
1        2     gizmo
2        3    gadget
3        4  sprocket
4        5    button
5        6    square
6        7  triangle

In [64]:
machines

   machine_id     name     type
0           1    alpha  printer
1           2    bravo  printer
2           3  charlie  printer
3           4    delta  printer

#### Determine the number of items and distinct parts in job_id=3

In [65]:
parts_in_jobs.loc[parts_in_jobs['job_id']==3].copy().\
merge(parts.loc[:,['part_id', 'type']].copy(), on='part_id', how='left')

   item_id  part_id  job_id      type
0        5        2       3     gizmo
1        6        4       3  sprocket

In [66]:
# Number of items in job_id=3
parts_in_jobs.loc[parts_in_jobs['job_id']==3].copy().\
merge(parts.loc[:,['part_id', 'type']].copy(), on='part_id', how='left').\
groupby(['job_id']).size().reset_index(name='num_rows')

   job_id  num_rows
0       3         2

In [67]:
# Number of distinct parts in job_id=3
len(parts_in_jobs.loc[parts_in_jobs['job_id']==3].copy().\
merge(parts.loc[:,['part_id', 'type']].copy(), on='part_id', how='left').\
groupby(['part_id']).size().reset_index(name='num_rows').\
index)

2

#### Count of devices assembled by employe named 'Chuck'

In [68]:
devices

   device_id          class
0          1      doohickey
1          2          thing
2          3  whachmacallit
3          4         object

In [69]:
employees

   employee_id   name  started
0            1  Alice     2017
1            2    Bob     2018
2            3  Chuck     2020
3            4   Dave     2019
4            5  Emily     2011

In [70]:
emp_assembles_devices

    assembly_id  device_id  employee_id
0             1          2            4
1             2          1            2
2             3          2            2
3             4          4            5
4             5          2            2
5             6          4            5
6             7          1            2
7             8          3            2
8             9          4            3
9            10          1            3
10           11          2            1
11           12          2            1
12           13          3            3
13           14          3            2
14           15          3            5
15           16          4            2
16           17          4            5
17           18          3            4
18           19          2            3
19           20          2            1
20           21          4            1
21           22          2            5
22           23          4            3
23           24          1            4
24           25          1            4
25           26          1            1
26           27          1            1
27           28          2            3
28           29          2            3
29           30          4            2
30           31          3            4
31           32          2            5
32           33          3            5
33           34          1            3
34           35          4            5
35           36          2            4
36           37          1            3
37           38          2            3
38           39          3            3
39           40          1            2
40           41          2            5
41           42          2            1
42           43          4            2
43           44          1            5
44           45          3            4
45           46          3            3
46           47          1            1
47           48          3            3
48           49          4            4
49           50          4            5

In [71]:
emp_assembles_devices.loc[:,['device_id', 'employee_id']].copy().\
merge(employees.loc[:, ['employee_id', 'name']].copy(), on='employee_id', how='left').\
groupby(['device_id', 'employee_id', 'name']).size().reset_index(name='num_rows').\
groupby(['employee_id', 'name']).size().reset_index(name='num_rows')

   employee_id   name  num_rows
0            1  Alice         3
1            2    Bob         4
2            3  Chuck         4
3            4   Dave         4
4            5  Emily         4

In [72]:
devices

   device_id          class
0          1      doohickey
1          2          thing
2          3  whachmacallit
3          4         object